Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегическиеЦели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеИсполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДТ1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДТ2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДТ3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДТ4</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЭтапыДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЭтапыДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Формирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Задачи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Договоры</xr:Item>
				<xr:Item>Catalog.БиблиотекаПроцессов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодовоеНаименование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниClado</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторонаЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоКИсполнению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДефекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДефектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПотребности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнструментыТОИР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Проекты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Перемещение товаров
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_Проект";
	КомандаПечати.Представление = НСтр("ru = 'Печать проекта'");
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// Печать накладной на перемещение.
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_Проект");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_Проект",
			НСтр("ru = 'Печать проекта'"),
			ПечатнаяФормаДоговора(МассивОбъектов, ОбъектыПечати),
			,
			"Отчет.ПечатьТекущихЗадач.ПФ_Договор");
	КонецЕсли;
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#Область СлужебныеПроцедурыИФункции

Функция ПечатнаяФормаДоговора(МассивОбъектов, ОбъектыПечати)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Ссылка,
	|	Договоры.Код КАК Код,
	|	Договоры.Наименование КАК Наименование,
	|	Договоры.Администратор КАК Администратор,
	|	Договоры.ТипДоговора КАК ТипДоговора,
	|	Договоры.ДатаНачала КАК ДатаНачала,
	|	Договоры.ДатаОкончания КАК ДатаОкончания,
	|	Договоры.Контрагент КАК Контрагент,
	|	Договоры.НаименованиеДоговора КАК НаименованиеДоговора,
	|	Договоры.СостояниеИсполнения КАК СостояниеИсполнения,
	|	Договоры.Администратор.Представление КАК АдминистраторПредставление,
	|	ВЫБОР
	|		КОГДА Договоры.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.ДТ3)
	|			ТОГДА Договоры.НаименованиеСтороны1
	|		ИНАЧЕ ""Заказчик""
	|	КОНЕЦ КАК НаименованиеСтороны1,
	|	ВЫБОР
	|		КОГДА Договоры.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.ДТ3)
	|			ТОГДА Договоры.НаименованиеСтороны2
	|		ИНАЧЕ ""Исполнитель""
	|	КОНЕЦ КАК НаименованиеСтороны2,
	|	Договоры.Представление КАК Представление,
	|	Договоры.Проект КАК Проект
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Проект В(&Ссылка)
	|ИТОГИ ПО
	|	Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Задачи.Ссылка КАК Ссылка,
	|	Задачи.Владелец КАК Договор,
	|	Задачи.ЭтапДоговора КАК ЭтапДоговора,
	|	Задачи.СторонаЗадачи КАК СторонаЗадачи,
	|	Задачи.Представление КАК Наименование,
	|	Задачи.Администратор КАК Администратор,
	|	Задачи.ДатаНачала КАК ДатаНачала,
	|	Задачи.ДатаОкончания КАК ДатаОкончания,
	|	Задачи.СтатусЗадачи КАК СтатусЗадачи,
	|	Задачи.Владелец.Проект КАК Проект
	|ИЗ
	|	Справочник.Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Владелец.Проект В(&Ссылка)
	|	И НЕ Задачи.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Договор,
	|	ЭтапДоговора,
	|	СторонаЗадачи,
	|	Ссылка ИЕРАРХИЯ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ШапкаПроект = Пакет[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ТаблицаЗадачи = Пакет[1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПФ_Проект";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.ПечатьТекущихЗадач.ПФ_Договор");
	
	Пока ШапкаПроект.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ОбластьЗаголовокОбщий = Макет.ПолучитьОбласть("ЗаголовокОбщий");
		ОбластьЗаголовокОбщий.Параметры.ТекстЗаголовка = "Договоры в рамках проекта """ +ШапкаПроект.Проект + """.";
		ТабличныйДокумент.Вывести(ОбластьЗаголовокОбщий);
		
		Шапка = ШапкаПроект.Выбрать();
		Пока Шапка.Следующий() Цикл
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
			Если  Шапка.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.ДТ4") Тогда
				ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаДТ4");
			Иначе
				ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			КонецЕсли;
			
			ОбластьЗаголовок.Параметры.НаименованиеДоговора = Шапка.Представление;
			//ОбластьЗаголовок.Параметры.Администратор = Шапка.АдминистраторПредставление;
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			Если  Шапка.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.ДТ1")
				ИЛИ   Шапка.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.ДТ2") Тогда

				//Формирование
				ОбластьШапка.Параметры.Этап = "Этап формирования";
				ОбластьШапка.Параметры.НаименованиеСТороны1 = Шапка.НаименованиеСТороны1;
				ОбластьШапка.Параметры.НаименованиеСТороны2 = Шапка.НаименованиеСТороны2;
				ТабличныйДокумент.Вывести(ОбластьШапка);
				
				СтрокиТаблицыЗадачи = ТаблицаЗадачи.Строки.НайтиСтроки(Новый Структура("Договор, ЭтапДоговора, СторонаЗадачи", Шапка.Ссылка, Перечисления.ЭтапыДоговора.Формирование, 1));
				Таб1 = ПолучитьНовуюТЗЗадач();
				ЗаполнитьТаблицуРекурсивно(Таб1, СтрокиТаблицыЗадачи);
				СтрокиТаблицыЗадачи = ТаблицаЗадачи.Строки.НайтиСтроки(Новый Структура("Договор, ЭтапДоговора, СторонаЗадачи", Шапка.Ссылка, Перечисления.ЭтапыДоговора.Формирование, 2));
				Таб2 = ПолучитьНовуюТЗЗадач();
				ЗаполнитьТаблицуРекурсивно(Таб2, СтрокиТаблицыЗадачи);
				
				Кол1 = Таб1.Количество();
				Кол2 = Таб2.Количество();
				Для Инд = 1 По Макс(Кол1, Кол2) Цикл
					
					Если Инд <= Кол1 Тогда
						Задача1 = СтрШаблон("%1 - %2 - %3 - %4 - %5",  Таб1[Инд-1].Наименование , Формат(Таб1[Инд-1].ДатаНачала, "ДФ=dd.MM.yyyy"), Формат(Таб1[Инд-1].ДатаОкончания, "ДФ=dd.MM.yyyy"), Таб1[Инд-1].Администратор, Таб1[Инд-1].СтатусЗадачи);
						ОбластьСтрока.Параметры.Задача1 = Задача1;
					Иначе
						ОбластьСтрока.Параметры.Задача1 = "";
					КонецЕсли;
					
					Если Инд <= Кол2 Тогда
						Задача2 = СтрШаблон("%1 - %2 - %3 - %4 - %5",  Таб2[Инд-1].Наименование , Формат(Таб2[Инд-1].ДатаНачала, "ДФ=dd.MM.yyyy"), Формат(Таб2[Инд-1].ДатаОкончания, "ДФ=dd.MM.yyyy"), Таб2[Инд-1].Администратор, Таб2[Инд-1].СтатусЗадачи);
						ОбластьСтрока.Параметры.Задача2 = Задача2;
					Иначе
						ОбластьСтрока.Параметры.Задача2 = "";
					КонецЕсли;
					ТабличныйДокумент.Вывести(ОбластьСтрока);
				КонецЦикла;
			КонецЕсли;	
			
			Если НЕ  Шапка.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.ДТ4") Тогда
				//исполнение
				ОбластьШапка.Параметры.Этап = "Этап исполнения";
				ОбластьШапка.Параметры.НаименованиеСТороны1 = Шапка.НаименованиеСТороны1;
				ОбластьШапка.Параметры.НаименованиеСТороны2 = Шапка.НаименованиеСТороны2;
				ТабличныйДокумент.Вывести(ОбластьШапка);
			КонецЕсли;
			
			Если  Шапка.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.ДТ4") Тогда
				СтрокиТаблицыЗадачи = ТаблицаЗадачи.Строки.НайтиСтроки(Новый Структура("Договор, ЭтапДоговора, СторонаЗадачи", Шапка.Ссылка, Перечисления.ЭтапыДоговора.Исполнение, 1));
				Таб1 = ПолучитьНовуюТЗЗадач();
				ЗаполнитьТаблицуРекурсивно(Таб1, СтрокиТаблицыЗадачи);
				
				Для Инд = 1 По Таб1.Количество() Цикл
					Задача1 = СтрШаблон("%1 - %2 - %3 - %4 - %5",  Таб1[Инд-1].Наименование , Формат(Таб1[Инд-1].ДатаНачала, "ДФ=dd.MM.yyyy"), Формат(Таб1[Инд-1].ДатаОкончания, "ДФ=dd.MM.yyyy"), Таб1[Инд-1].Администратор, Таб1[Инд-1].СтатусЗадачи);
					ОбластьСтрока.Параметры.Задача1 = Задача1;
					ТабличныйДокумент.Вывести(ОбластьСтрока);
				КонецЦикла;
			Иначе
				СтрокиТаблицыЗадачи = ТаблицаЗадачи.Строки.НайтиСтроки(Новый Структура("Договор, ЭтапДоговора, СторонаЗадачи", Шапка.Ссылка, Перечисления.ЭтапыДоговора.Исполнение, 1));
				Таб1 = ПолучитьНовуюТЗЗадач();
				ЗаполнитьТаблицуРекурсивно(Таб1, СтрокиТаблицыЗадачи);
				СтрокиТаблицыЗадачи = ТаблицаЗадачи.Строки.НайтиСтроки(Новый Структура("Договор, ЭтапДоговора, СторонаЗадачи", Шапка.Ссылка, Перечисления.ЭтапыДоговора.Исполнение, 2));
				Таб2 = ПолучитьНовуюТЗЗадач();
				ЗаполнитьТаблицуРекурсивно(Таб2, СтрокиТаблицыЗадачи);
				
				
				Кол1 = Таб1.Количество();
				Кол2 = Таб2.Количество();
				Для Инд = 1 По Макс(Кол1, Кол2) Цикл
					
					Если Инд <= Кол1 Тогда
						Задача1 = СтрШаблон("%1 - %2 - %3 - %4 - %5",  Таб1[Инд-1].Наименование , Формат(Таб1[Инд-1].ДатаНачала, "ДФ=dd.MM.yyyy"), Формат(Таб1[Инд-1].ДатаОкончания, "ДФ=dd.MM.yyyy"), Таб1[Инд-1].Администратор, Таб1[Инд-1].СтатусЗадачи);
						ОбластьСтрока.Параметры.Задача1 = Задача1;
					Иначе
						ОбластьСтрока.Параметры.Задача1 = "";
					КонецЕсли;
					
					Если Инд <= Кол2 Тогда
						Задача2 = СтрШаблон("%1 - %2 - %3 - %4 - %5",  Таб2[Инд-1].Наименование , Формат(Таб2[Инд-1].ДатаНачала, "ДФ=dd.MM.yyyy"), Формат(Таб2[Инд-1].ДатаОкончания, "ДФ=dd.MM.yyyy"), Таб2[Инд-1].Администратор, Таб2[Инд-1].СтатусЗадачи);
						ОбластьСтрока.Параметры.Задача2 = Задача2;
						//ОбластьСтрока.Параметры.Задача2 = Таб2[Инд-1].Наименование;
					Иначе
						ОбластьСтрока.Параметры.Задача2 = "";
					КонецЕсли;
					ТабличныйДокумент.Вывести(ОбластьСтрока);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
	
КонецФункции

Процедура ЗаполнитьТаблицуРекурсивно(Таб1, Выборка)
	Для Каждого Строка Из Выборка Цикл
		Стр = Таб1.Добавить();
		Стр.Уровень = Строка.Уровень();
		Стр.Наименование = Строка.Наименование;
		Для ин = 1 по Стр.Уровень Цикл
			Стр.Наименование = Символы.Таб + Стр.Наименование;
		КонецЦикла;
		Стр.СтатусЗадачи = Строка.СтатусЗадачи;
		Стр.Администратор = Строка.Администратор;
		Стр.ДатаНачала = Строка.ДатаНачала;
		Стр.ДатаОкончания = Строка.ДатаОкончания;
		ЗаполнитьТаблицуРекурсивно(Таб1, Строка.Строки);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьНовуюТЗЗадач()
	Таб = Новый ТаблицаЗначений;
	Таб.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Таб.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число"));
	Таб.Колонки.Добавить("СтатусЗадачи", Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	Таб.Колонки.Добавить("Администратор", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Таб.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	Таб.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	Возврат ТАб
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = "ПР - " + Данные.Наименование;
КонецПроцедуры

#КонецОбласти
#КонецЕсли
